4 - сделан рефакторинг спаунера, теперь типы крипов описаны ввиде объектов. добавлена проверка на наличие харвестеров перед созданием крипов других типов
    добавлен механизм автобаланса размера тушки крипов
    в список получателей энергии харвестеров добавлены контейнеры
    в список точек лечения хилеров добавлены контейнеры
    хилер получает энергию из контейнера
    хилеру задан приоритет чинить дороги в первую очередь
    
6 - добавлен Claimer

    TODO: 
    ! Не придумал как удобно использовать наследование
    Добавить режим - комнатаатакована, для крипов и башен
    renew для крипов
    эффективное использование источников энергии (кейс когда один сточник пуст и крипы стоят)